{"data":{"allPrismicNewspost":{"edges":[{"node":{"id":"Prismic__Newspost__W98qmhEAACQALHbK","data":{"id":9,"title":{"text":"Kemp charges Georgia Democrats with attempted voter hack. Abrams fires back: 'Desperate.'","html":"<h1>Kemp charges Georgia Democrats with attempted voter hack. Abrams fires back: &#39;Desperate.&#39;</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/b92e06c4ea7b3a67a9f604fd36c9d3f2ac25bf3c_181010-brian-kemp-ew-413p_b7a4a2f2985c6edca36fb47f4d691bee.jpg"},"description":{"text":"Georgia Secretary of State Brian Kemp, the Republican contender for senator, said Sunday he was exploring the state Democratic Party for an endeavored hack of the voter enlistment framework — a case met with a quick reaction from Democrats accusing him of an improper \"political trick\" two days before Election Day.  Kemp, who is in a neck-and-neck race with Stacey Abrams, claimed that the state Democratic Party made a \"fizzled endeavor to hack the state's voter enlistment framework,\" and reported his office was opening an examination concerning the gathering. Kemp said his office alarmed the Department of Homeland Security and the FBI and offered no proof to back up his claim.  \"While we can't remark on the specifics of a continuous examination, I can affirm that the Democratic Party of Georgia is under scrutiny for conceivable digital violations,\" Candice Broce, squeeze secretary for the secretary of state, said in an announcement. \"We can likewise affirm that no close to home information was ruptured and our framework stays secure.\"  Stacey Abrams: Trump's own assault 'dull and shallow'  Democrats impacted the declaration, which comes in the midst of the scenery of one of the country's most savagely challenged races in front of Election Day on Tuesday.  Rebecca DeHart, official chief of the state's Democratic Party, said in an explanation that the examination was \"one more case of maltreatment of intensity by an untrustworthy Secretary of State.\"  \"To be clear, Brian Kemp's indecent cases are 100 percent false, and this supposed examination was obscure to the Democratic Party of Georgia until the point that a battle agent in Kemp's legitimate office discharged an announcement early today,\" DeHart said. \"This political trick from Kemp only days before the race is one more case of why he can't be trusted and ought not be administering a decision in which he is likewise a contender for senator.\"  Amid a meeting with CNN's Jake Tapper on \"Condition of the Union\" Sunday, Abrams called Kemp's declaration \"an edgy endeavor with respect to my rival to divert individuals from\" legal decisions that had conflicted with choices he made as secretary of express, the workplace that regulates casting a ballot in the state.  In one such fight, a government judge ruled against Kemp on Friday and chose that the state must make it simpler for a few people hailed under Georgia's \"correct match\" law to cast a ballot.  \"He is edgy to dismiss the discussion from his disappointments, from his refusal to respect his responsibilities, and from the way that he's a piece of an across the nation arrangement of voter concealment that won't work in this race since we're going to outwork him, we will out vote him ... furthermore, we will win,\" Abrams said.  Three races to watch on decision night  Full Panel: Midterm energy turnout approaches 'presidential' levels  The race's most conspicuous forward and backward includes Kemp's present job as the state's best race official. That contention fixates on Kemp cleansing a huge number of voters, the greater part of whom are dark, from voter moves in front of one week from now's race. Kemp has denied that he is endeavoring to smother the dark vote, saying that he is just after the law.  Abrams has blamed Kemp for undermining trust in majority rule government and making \"an air of dread\" for voters through his activities as secretary of state — charges that Kemp has called \"a joke.\"  Previous President Jimmy Carter, a Georgian, as of late called for Kemp to leave from his position.  Additionally Sunday, Kemp tweeted out a photograph of five individuals he said were dressed as individuals from The New Black Panther Party and held signs in help of Abrams. That gathering is portrayed by The Southern Poverty Law Center as \"a harmfully supremacist and hostile to Semitic association whose pioneers have supported brutality against whites, Jews and law implementation officers.\"  Senator competitor, GA  How radical is my adversary? Take a gander at who is supporting her. The New Black Panther Party is \"a racist...antisemitic association whose pioneers have supported brutality against whites, Jews, and law requirement\" RT in the event that you concur that Abrams and the Black Panthers are TOO EXTREME for GA!  Abigail Collazo, a representative for the Abrams battle, said in an explanation that Kemp \"is the main hopeful in this race who has modeled for pictures with supporters wearing bigot, despise filled shirts and declined to impugn them, while Abrams keeps on censuring any supremacist, hostile to Semitic, or generally prejudicial words and activities.\"  Surveying has demonstrated the race to be tight. An October NBC News/Marist survey found that the race is basically tied, with likely voters favoring Kemp by a 49 percent to 47 percent spread, a number inside the survey's wiggle room. Among enrolled voters, the two competitors are tied at 47 percent.  On the off chance that she wins, Abrams would turn into that country's first dark female representative.","html":"<p>Georgia Secretary of State Brian Kemp, the Republican contender for senator, said Sunday he was exploring the state Democratic Party for an endeavored hack of the voter enlistment framework — a case met with a quick reaction from Democrats accusing him of an improper &quot;political trick&quot; two days before Election Day. </p><p>Kemp, who is in a neck-and-neck race with Stacey Abrams, claimed that the state Democratic Party made a &quot;fizzled endeavor to hack the state&#39;s voter enlistment framework,&quot; and reported his office was opening an examination concerning the gathering. Kemp said his office alarmed the Department of Homeland Security and the FBI and offered no proof to back up his claim. </p><p>&quot;While we can&#39;t remark on the specifics of a continuous examination, I can affirm that the Democratic Party of Georgia is under scrutiny for conceivable digital violations,&quot; Candice Broce, squeeze secretary for the secretary of state, said in an announcement. &quot;We can likewise affirm that no close to home information was ruptured and our framework stays secure.&quot; </p><p>Stacey Abrams: Trump&#39;s own assault &#39;dull and shallow&#39; </p><p>Democrats impacted the declaration, which comes in the midst of the scenery of one of the country&#39;s most savagely challenged races in front of Election Day on Tuesday. </p><p>Rebecca DeHart, official chief of the state&#39;s Democratic Party, said in an explanation that the examination was &quot;one more case of maltreatment of intensity by an untrustworthy Secretary of State.&quot; </p><p>&quot;To be clear, Brian Kemp&#39;s indecent cases are 100 percent false, and this supposed examination was obscure to the Democratic Party of Georgia until the point that a battle agent in Kemp&#39;s legitimate office discharged an announcement early today,&quot; DeHart said. &quot;This political trick from Kemp only days before the race is one more case of why he can&#39;t be trusted and ought not be administering a decision in which he is likewise a contender for senator.&quot; </p><p>Amid a meeting with CNN&#39;s Jake Tapper on &quot;Condition of the Union&quot; Sunday, Abrams called Kemp&#39;s declaration &quot;an edgy endeavor with respect to my rival to divert individuals from&quot; legal decisions that had conflicted with choices he made as secretary of express, the workplace that regulates casting a ballot in the state. </p><p>In one such fight, a government judge ruled against Kemp on Friday and chose that the state must make it simpler for a few people hailed under Georgia&#39;s &quot;correct match&quot; law to cast a ballot. </p><p>&quot;He is edgy to dismiss the discussion from his disappointments, from his refusal to respect his responsibilities, and from the way that he&#39;s a piece of an across the nation arrangement of voter concealment that won&#39;t work in this race since we&#39;re going to outwork him, we will out vote him ... furthermore, we will win,&quot; Abrams said. </p><p>Three races to watch on decision night </p><p>Full Panel: Midterm energy turnout approaches &#39;presidential&#39; levels </p><p>The race&#39;s most conspicuous forward and backward includes Kemp&#39;s present job as the state&#39;s best race official. That contention fixates on Kemp cleansing a huge number of voters, the greater part of whom are dark, from voter moves in front of one week from now&#39;s race. Kemp has denied that he is endeavoring to smother the dark vote, saying that he is just after the law. </p><p>Abrams has blamed Kemp for undermining trust in majority rule government and making &quot;an air of dread&quot; for voters through his activities as secretary of state — charges that Kemp has called &quot;a joke.&quot; </p><p>Previous President Jimmy Carter, a Georgian, as of late called for Kemp to leave from his position. </p><p>Additionally Sunday, Kemp tweeted out a photograph of five individuals he said were dressed as individuals from The New Black Panther Party and held signs in help of Abrams. That gathering is portrayed by The Southern Poverty Law Center as &quot;a harmfully supremacist and hostile to Semitic association whose pioneers have supported brutality against whites, Jews and law implementation officers.&quot; </p><p>Senator competitor, GA </p><p>How radical is my adversary? Take a gander at who is supporting her. The New Black Panther Party is &quot;a racist...antisemitic association whose pioneers have supported brutality against whites, Jews, and law requirement&quot; RT in the event that you concur that Abrams and the Black Panthers are TOO EXTREME for GA! </p><p>Abigail Collazo, a representative for the Abrams battle, said in an explanation that Kemp &quot;is the main hopeful in this race who has modeled for pictures with supporters wearing bigot, despise filled shirts and declined to impugn them, while Abrams keeps on censuring any supremacist, hostile to Semitic, or generally prejudicial words and activities.&quot; </p><p>Surveying has demonstrated the race to be tight. An October NBC News/Marist survey found that the race is basically tied, with likely voters favoring Kemp by a 49 percent to 47 percent spread, a number inside the survey&#39;s wiggle room. Among enrolled voters, the two competitors are tied at 47 percent. </p><p>On the off chance that she wins, Abrams would turn into that country&#39;s first dark female representative.</p>"}}}}]}},"pageContext":{"productId":9}}