{"data":{"allPrismicNewspost":{"edges":[{"node":{"id":"Prismic__Newspost__W98kwREAACMALFz2","data":{"id":1,"title":{"text":"Liverpool makes a stand and runs far-right marchers out of town","html":"<h1>Liverpool makes a stand and runs far-right marchers out of town</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/15635b5f37dfb6e20786eac92c16959c03649965_3500.jpg"},"description":{"text":"A far-right gathering has relinquished plans to walk through Liverpool after individuals were obviously dwarfed by counter-demonstrators, including the chairman of Liverpool, Joe Anderson.  A bunch of marchers from the supposed North West Frontline Patriots were met by several enemy of fundamentalist counter-dissidents co-ordinated by gatherings, for example, Merseyside Together and Unite Against Fascism as they touched base in Liverpool on Saturday.  \"Quiet individuals control pursued the extremists off our boulevards,\" Anderson, a Labor legislator, stated, adding that he needed to \"demonstrate these individuals they are not welcome in this city\".  \"I need it to be quiet, however I need individuals to be out in the city saying they are not welcome in our city,\" Anderson advised the Liverpool Echo preceding the walk. \"A few people on Twitter have said to me: 'Shouldn't something be said about free discourse?' Well that accompanies a duty not to embrace abhor.\"  Merseyside police said one individual was captured on doubt of break of the peace, while another was held for an open request offense. A representative was not quickly ready to state which bunch the kept people were supporting.  Police did not give a gauge of group sizes, but rather the Liverpool Echo revealed from the scene that the counter-demonstrators were out in far more noteworthy numbers.  About six individuals were seen touching base at Moorfields station and being escorted outside by police before quickly returning inside, as hordes of counter-dissidents recited \"No pasaran\" while holding notices announcing \"No to Racism\".  The gathering had apparently planned to walk from Moorfields station at its Exchange Street entrance along Dale Street to Derby Square. There was a major police nearness set up to escort them along that course.  Notwithstanding, they scarcely made it out of the station. The counter bigot amass Hope Not Hate stated: \"Five fundamentalists turned up for a walk in Liverpool today. Satisfied to report they exited following five minutes.\"  ","html":"<p>A far-right gathering has relinquished plans to walk through Liverpool after individuals were obviously dwarfed by counter-demonstrators, including the chairman of Liverpool, Joe Anderson. </p><p>A bunch of marchers from the supposed North West Frontline Patriots were met by several enemy of fundamentalist counter-dissidents co-ordinated by gatherings, for example, Merseyside Together and Unite Against Fascism as they touched base in Liverpool on Saturday. </p><p>&quot;Quiet individuals control pursued the extremists off our boulevards,&quot; Anderson, a Labor legislator, stated, adding that he needed to &quot;demonstrate these individuals they are not welcome in this city&quot;. </p><p>&quot;I need it to be quiet, however I need individuals to be out in the city saying they are not welcome in our city,&quot; Anderson advised the Liverpool Echo preceding the walk. &quot;A few people on Twitter have said to me: &#39;Shouldn&#39;t something be said about free discourse?&#39; Well that accompanies a duty not to embrace abhor.&quot; </p><p>Merseyside police said one individual was captured on doubt of break of the peace, while another was held for an open request offense. A representative was not quickly ready to state which bunch the kept people were supporting. </p><p>Police did not give a gauge of group sizes, but rather the Liverpool Echo revealed from the scene that the counter-demonstrators were out in far more noteworthy numbers. </p><p>About six individuals were seen touching base at Moorfields station and being escorted outside by police before quickly returning inside, as hordes of counter-dissidents recited &quot;No pasaran&quot; while holding notices announcing &quot;No to Racism&quot;. </p><p>The gathering had apparently planned to walk from Moorfields station at its Exchange Street entrance along Dale Street to Derby Square. There was a major police nearness set up to escort them along that course. </p><p>Notwithstanding, they scarcely made it out of the station. The counter bigot amass Hope Not Hate stated: &quot;Five fundamentalists turned up for a walk in Liverpool today. Satisfied to report they exited following five minutes.&quot;</p><p></p><p></p>"}}}}]}},"pageContext":{"productId":1}}