{"data":{"allPrismicNewspost":{"edges":[{"node":{"id":"Prismic__Newspost__W98pABEAACYALG-q","data":{"id":7,"title":{"text":"Unlucky Pigeon Gets Shot By Ceremonial Cannon As It Flies Through Line Of Fire","html":"<h1>Unlucky Pigeon Gets Shot By Ceremonial Cannon As It Flies Through Line Of Fire</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/5ee1bd67f27d948baeb11a933b8a47f37f35039d_1_what-are-the-chances-pigeon-finds-itself-in-the-wrong-place-at-the-wrong-time-as-it-gets-blown-to.jpg"},"description":{"text":"We've all picked to leave our jacket at home, just for the skies to exuberantly piss it down, and as we stroll along the road we get crapped on by a winged creature. Wrong place, wrong time what not.  Be that as it may, has anybody at any point passed a gun at the correct minute it goes off? Didn't think so.  This fowl did only that when it flew into the line of a stylized gun as it was discharged in Malta.  Since the nineteenth century, Malta has utilized clear adjusts instead of live ammo for its salute, which marks late morning. Not that it would have had a touch of effect for this poor person.  The Mirror announced that it's not known whether the pigeon was murdered or not but rather as indicated by Karl Oliver, a honeymooner who shot the recording, things didn't end well as you can most likely envision.  He stated: \"We went to the saluting battery for the second time as it was drizzling the main, first column tickets.  \"At that point when we were glancing through the recording outline by casing, we saw the pigeon stopped to exist after the terminating.\"  Unavoidably, it didn't take well before individuals were discussing the 70s animation Dastardly and Muttley In Their Flying Machines, otherwise called Stop the Pigeon.  One person took to Twitter saying: \"Obnoxious and Muttley at last halted that pigeon.\"  Another additional: \"Looks like Dick Dastardly and Muttley at long last got him.\"  A third remarked: \"get the pigeon, get the pigeon...\"  Another little fella who wound up in an unlucky spot was a Golden Retriever named Todd.  He was nibbled in the face by a poisonous snake amid a stroll with his proprietor, Paula Godwin, in Anthem, Arizona.  Todd was given a neutralizing agent venom infusion when he was seen by the vet and following a 12-hour stay he was permitted to return home, but with a fairly swollen face.  Like the pigeon in Malta, Todd was in an unlucky spot - despite the fact that at any rate this time there was a more joyful result, as that the pupper was granted 'Pooch of The Year' for his endeavors. Such a decent kid.","html":"<p>We&#39;ve all picked to leave our jacket at home, just for the skies to exuberantly piss it down, and as we stroll along the road we get crapped on by a winged creature. Wrong place, wrong time what not. </p><p>Be that as it may, has anybody at any point passed a gun at the correct minute it goes off? Didn&#39;t think so. </p><p>This fowl did only that when it flew into the line of a stylized gun as it was discharged in Malta. </p><p>Since the nineteenth century, Malta has utilized clear adjusts instead of live ammo for its salute, which marks late morning. Not that it would have had a touch of effect for this poor person. </p><p>The Mirror announced that it&#39;s not known whether the pigeon was murdered or not but rather as indicated by Karl Oliver, a honeymooner who shot the recording, things didn&#39;t end well as you can most likely envision. </p><p>He stated: &quot;We went to the saluting battery for the second time as it was drizzling the main, first column tickets. </p><p>&quot;At that point when we were glancing through the recording outline by casing, we saw the pigeon stopped to exist after the terminating.&quot; </p><p>Unavoidably, it didn&#39;t take well before individuals were discussing the 70s animation Dastardly and Muttley In Their Flying Machines, otherwise called Stop the Pigeon. </p><p>One person took to Twitter saying: &quot;Obnoxious and Muttley at last halted that pigeon.&quot; </p><p>Another additional: &quot;Looks like Dick Dastardly and Muttley at long last got him.&quot; </p><p>A third remarked: &quot;get the pigeon, get the pigeon...&quot; </p><p>Another little fella who wound up in an unlucky spot was a Golden Retriever named Todd. </p><p>He was nibbled in the face by a poisonous snake amid a stroll with his proprietor, Paula Godwin, in Anthem, Arizona. </p><p>Todd was given a neutralizing agent venom infusion when he was seen by the vet and following a 12-hour stay he was permitted to return home, but with a fairly swollen face. </p><p>Like the pigeon in Malta, Todd was in an unlucky spot - despite the fact that at any rate this time there was a more joyful result, as that the pupper was granted &#39;Pooch of The Year&#39; for his endeavors. Such a decent kid.</p>"}}}}]}},"pageContext":{"productId":7}}