{"data":{"allPrismicNewspost":{"edges":[{"node":{"id":"Prismic__Newspost__W98l8xEAACcALGIi","data":{"id":3,"title":{"text":"$145M Texas border wall project awarded, Customs and Border Protection says","html":"<h1>$145M Texas border wall project awarded, Customs and Border Protection says</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/b19e7d6df5b061f0da97d21b22a8b5e8b7ced099_mexico-usa-border.jpg"},"description":{"text":"A $145 million development venture was granted Wednesday to fabricate about six miles of outskirt divider in Texas, Customs and Border Protection (CBP) reported on Friday.  The office, related to the Army Corps of Engineers, gave the multimillion-dollar work in the Border Patrol's Rio Grande Valley Sector to SLSCO, CBP said in a news discharge.  Work on the undertaking, additionally referred to by CBP as RGV-03, is relied upon to commence in February, the office said.  Among the foreseen work is the building and set up \"of strategic framework,\" which incorporates \"a strengthened solid levee divider to the stature of the current levee, 18 feet tall steel bollards introduced over the solid divider, and vegetation expulsion along a 150 foot requirement zone all through the roughly six miles of levee divider framework,\" the news discharge said.  The zone will likewise be furnished with identification innovation and video observation, the office said.  The Rio Grande Valley Sector has \"high unlawful cross fringe action,\" as per CBP.  \"Once built, this levee divider framework will fill in as a constant obstruction to transnational criminal associations, while as yet permitting stream access for property proprietors, other government/state/nearby authorities, neighborhood crisis responders, and USBP,\" the organization said.  \"CBP keeps on actualizing President Trump's Executive Order 13767 - otherwise called Border Security and Immigration Enforcement Improvements - and keeps on making moves to speedily plan, structure, and develop a physical divider utilizing fitting materials and innovation to most viably accomplish finish operational control of the southern fringe,\" the organization proceeded.  The declaration from the CBP comes as a train of Central American vagrants advances to the U.S.- Mexico outskirt, and as Trump has disclosed plans to send troops at the southern fringe.","html":"<p>A $145 million development venture was granted Wednesday to fabricate about six miles of outskirt divider in Texas, Customs and Border Protection (CBP) reported on Friday. </p><p>The office, related to the Army Corps of Engineers, gave the multimillion-dollar work in the Border Patrol&#39;s Rio Grande Valley Sector to SLSCO, CBP said in a news discharge. </p><p>Work on the undertaking, additionally referred to by CBP as RGV-03, is relied upon to commence in February, the office said. </p><p>Among the foreseen work is the building and set up &quot;of strategic framework,&quot; which incorporates &quot;a strengthened solid levee divider to the stature of the current levee, 18 feet tall steel bollards introduced over the solid divider, and vegetation expulsion along a 150 foot requirement zone all through the roughly six miles of levee divider framework,&quot; the news discharge said. </p><p>The zone will likewise be furnished with identification innovation and video observation, the office said. </p><p>The Rio Grande Valley Sector has &quot;high unlawful cross fringe action,&quot; as per CBP. </p><p>&quot;Once built, this levee divider framework will fill in as a constant obstruction to transnational criminal associations, while as yet permitting stream access for property proprietors, other government/state/nearby authorities, neighborhood crisis responders, and USBP,&quot; the organization said. </p><p>&quot;CBP keeps on actualizing President Trump&#39;s Executive Order 13767 - otherwise called Border Security and Immigration Enforcement Improvements - and keeps on making moves to speedily plan, structure, and develop a physical divider utilizing fitting materials and innovation to most viably accomplish finish operational control of the southern fringe,&quot; the organization proceeded. </p><p>The declaration from the CBP comes as a train of Central American vagrants advances to the U.S.- Mexico outskirt, and as Trump has disclosed plans to send troops at the southern fringe.</p>"}}}}]}},"pageContext":{"productId":3}}