{"data":{"allPrismicNewspost":{"edges":[{"node":{"id":"Prismic__Newspost__W98sChEAACcALH0o","data":{"id":11,"title":{"text":"White woman dubbed 'South Park Susan' for harassing black women turns herself into police","html":"<h1>White woman dubbed &#39;South Park Susan&#39; for harassing black women turns herself into police</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/e17b749a74855ed2c2eb320041ea03f6ea1796fb_181104-susan-jane-westwood-al-1003_7a0ce8db9a69b118b08b240ec2852d04.jpg"},"description":{"text":"A North Carolina white lady named \"South Park Susan\" who bothered two dark ladies while they sat tight for AAA street side help has transformed herself into police, as indicated by NBC News associate WCNC.  Susan Westwood, 51, handed herself over to the Sunset Beach Police Department on Saturday and was exchanged to the Brunswick County Sheriff's Department where she was presented with an exceptional wrongdoing warrant for abuse of the 911 framework, notwithstanding four criminal summons, as per WCNC.  An officer at the Brunswick County Sheriff's Department affirmed to NBC News that Westwood had been in care yet was discharged. He was not able give any extra points of interest.  Westwood was caught on record on Oct. 19 making bigot comments in an obvious inebriated rage went for Leisa Garris and her sister, Chele Garris.  \"Greetings, how are you? I'm hot. I'm delightful. I'm 51. What are we going to discuss today around evening time? Being hot? Being lovely? Being white? Being, my new weave. Do you, do you live here?\" she said to the ladies, previously inquiring as to whether their \"child daddy\" was with them.  She later referenced having a covered weapon and undermined to take it out, however it's vague in the event that she was entirely ownership of a weapon.  The Garris sisters called the police, yet when officers arrived, Westwood was mysteriously gone.  After the video became a web sensation, Westwood lost her activity at Charter Communications, which issued an announcement saying, \"The episode recorded in Charlotte is an explicit infringement of Charter's implicit rules and obviously slights the organization's pledge to incorporation and aware conduct.\"  A warrant was issued for her capture on Oct. 30, as per WCNC. After Westwood was charged, police said they couldn't capture her since they couldn't discover her.  The Brunswick Count Sheriff's Office did not promptly react to a demand made by NBC News for extra data about Westwood's charges.","html":"<p>A North Carolina white lady named &quot;South Park Susan&quot; who bothered two dark ladies while they sat tight for AAA street side help has transformed herself into police, as indicated by NBC News associate WCNC. </p><p>Susan Westwood, 51, handed herself over to the Sunset Beach Police Department on Saturday and was exchanged to the Brunswick County Sheriff&#39;s Department where she was presented with an exceptional wrongdoing warrant for abuse of the 911 framework, notwithstanding four criminal summons, as per WCNC. </p><p>An officer at the Brunswick County Sheriff&#39;s Department affirmed to NBC News that Westwood had been in care yet was discharged. He was not able give any extra points of interest. </p><p>Westwood was caught on record on Oct. 19 making bigot comments in an obvious inebriated rage went for Leisa Garris and her sister, Chele Garris. </p><p>&quot;Greetings, how are you? I&#39;m hot. I&#39;m delightful. I&#39;m 51. What are we going to discuss today around evening time? Being hot? Being lovely? Being white? Being, my new weave. Do you, do you live here?&quot; she said to the ladies, previously inquiring as to whether their &quot;child daddy&quot; was with them. </p><p>She later referenced having a covered weapon and undermined to take it out, however it&#39;s vague in the event that she was entirely ownership of a weapon. </p><p>The Garris sisters called the police, yet when officers arrived, Westwood was mysteriously gone. </p><p>After the video became a web sensation, Westwood lost her activity at Charter Communications, which issued an announcement saying, &quot;The episode recorded in Charlotte is an explicit infringement of Charter&#39;s implicit rules and obviously slights the organization&#39;s pledge to incorporation and aware conduct.&quot; </p><p>A warrant was issued for her capture on Oct. 30, as per WCNC. After Westwood was charged, police said they couldn&#39;t capture her since they couldn&#39;t discover her. </p><p>The Brunswick Count Sheriff&#39;s Office did not promptly react to a demand made by NBC News for extra data about Westwood&#39;s charges.</p>"}}}}]}},"pageContext":{"productId":11}}