{"data":{"allPrismicNewspost":{"edges":[{"node":{"id":"Prismic__Newspost__W98rRREAACMALHm_","data":{"id":10,"title":{"text":"'No evidence' to back Kavanaugh accusers' claims, Senate panel's report on FBI probe finds","html":"<h1>&#39;No evidence&#39; to back Kavanaugh accusers&#39; claims, Senate panel&#39;s report on FBI probe finds</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/83fe27b701e6d460a0d7207ddba9a49157d5d41e_6bbfb78a-bk1.jpg"},"description":{"text":"An examination concerning sexual unfortunate behavior charges against Supreme Court Justice Brett Kavanaugh by numerous ladies found that no observers could give proof to substantiate their cases, a letter to Senate Republicans from the Senate Judiciary Committee administrator said Friday.  As indicated by the 414-page report discharged by Sen. Throw Grassley, R-Iowa, agents talked with in excess of 40 individuals, observed online life and news reports and looked into proof given by the judge and his informers.  \"Following the different and broad examinations by both the Committee and the FBI, there was no proof to substantiate any of the cases of rape made against Justice Kavanaugh,\" the report states.  \"Following the different and broad examinations by both the Committee and the FBI, there was no proof to substantiate any of the cases of rape made against Justice Kavanaugh.\"  — Report by Senate Judiciary Committee  The sexual unfortunate behavior charges came amid the advisory group's hearings to choose whether Kavanaugh, whom President Trump designated in July to succeed resigning Justice Anthony Kennedy, would be affirmed. Kavanaugh's designation set off a fight between Republicans, a large portion of whom guarded the judge, and Democrats, who pushed for an expansive scale examination concerning the ladies' charges.  Among those addressed, the report stated, were Mark Judge, PJ Smyth, and Leland Keyser, the three people whom informer Christine Blasey Ford guaranteed were available in the house when Kavanaugh purportedly tossed her on a quaint little inn ambushed her at some point during the 1980s.  Grassley a month ago asked for that the FBI research informer Julie Swetnick and her lawyer, Michael Avenatti, who additionally speaks to pornography star Stormy Daniels in her charges against President Trump. Swetnick's validity was addressed after an ex disclosed to Fox News that \"she misrepresented everything\" and undermined to murder his unborn tyke.  TRUMP CHALLENGES DEMS AFTER KAVANAUGH ACCUSER ALLEGEDLY ADMITS TO MAKING FALSE RAPE CLAIM  Specialists found no proof to help either lady's cases. Swetnick additionally put forth a few opposing expressions about her cases amid TV meetings and declined to talk with board of trustees specialists, the letter said.  \"In reality, the proof seems to help the position that Julie Swetnick and Mr. Avenatti criminally schemed to put forth tangibly false expressions to the Committee and impede the Committee's examination.\"  \"To be sure, the proof seems to help the position that Julie Swetnick and Mr. Avenatti criminally contrived to put forth really false expressions to the Committee and hinder the Committee's examination.\"  — Chairman Chuck Grassley, Senate Judiciary Committee  Other claimed occurrences including Kavanaugh, said to have happened in three states, were observed not to be tenable.  Grassley likewise asked for an examination concerning Judy Munro-Leighton, who namelessly guaranteed Kavanaugh slapped her and constrained her to perform oral sex on him.  KAVANAUGH ACCUSER REFERRED TO DOJ FOR FALSE STATEMENTS, GRASSLEY'S OFFICE ANNOUNCES  Munro-Leighton reached the panel in October asserting she composed an unknown letter blaming the judge for sexual unfortunate behavior. Grassley said she later abjured creation and admitted to not knowing Kavanaugh under addressing from the board of trustees.  \"She later conceded that she was not its creator and only utilized it as a \"ploy\" to \"get consideration\" and had never met Justice Kavanaugh,\" as per the letter.  In September, President Trump requested a constrained FBI test into claims by Ford and informer Deborah Ramirez.  The examination found no proof of bad behavior on Kavanaugh's part.","html":"<p>An examination concerning sexual unfortunate behavior charges against Supreme Court Justice Brett Kavanaugh by numerous ladies found that no observers could give proof to substantiate their cases, a letter to Senate Republicans from the Senate Judiciary Committee administrator said Friday. </p><p>As indicated by the 414-page report discharged by Sen. Throw Grassley, R-Iowa, agents talked with in excess of 40 individuals, observed online life and news reports and looked into proof given by the judge and his informers. </p><p><em>&quot;Following the different and broad examinations by both the Committee and the FBI, there was no proof to substantiate any of the cases of rape made against Justice Kavanaugh,&quot; the report states. </em></p><p><em>&quot;Following the different and broad examinations by both the Committee and the FBI, there was no proof to substantiate any of the cases of rape made against Justice Kavanaugh.&quot; </em></p><p><em>— Report by Senate Judiciary Committee </em></p><p>The sexual unfortunate behavior charges came amid the advisory group&#39;s hearings to choose whether Kavanaugh, whom President Trump designated in July to succeed resigning Justice Anthony Kennedy, would be affirmed. Kavanaugh&#39;s designation set off a fight between Republicans, a large portion of whom guarded the judge, and Democrats, who pushed for an expansive scale examination concerning the ladies&#39; charges. </p><p>Among those addressed, the report stated, were Mark Judge, PJ Smyth, and Leland Keyser, the three people whom informer Christine Blasey Ford guaranteed were available in the house when Kavanaugh purportedly tossed her on a quaint little inn ambushed her at some point during the 1980s. </p><p>Grassley a month ago asked for that the FBI research informer Julie Swetnick and her lawyer, Michael Avenatti, who additionally speaks to pornography star Stormy Daniels in her charges against President Trump. Swetnick&#39;s validity was addressed after an ex disclosed to Fox News that &quot;she misrepresented everything&quot; and undermined to murder his unborn tyke. </p><h4>TRUMP CHALLENGES DEMS AFTER KAVANAUGH ACCUSER ALLEGEDLY ADMITS TO MAKING FALSE RAPE CLAIM </h4><p>Specialists found no proof to help either lady&#39;s cases. Swetnick additionally put forth a few opposing expressions about her cases amid TV meetings and declined to talk with board of trustees specialists, the letter said. </p><p><em>&quot;In reality, the proof seems to help the position that Julie Swetnick and Mr. Avenatti criminally schemed to put forth tangibly false expressions to the Committee and impede the Committee&#39;s examination.&quot; </em></p><p><em>&quot;To be sure, the proof seems to help the position that Julie Swetnick and Mr. Avenatti criminally contrived to put forth really false expressions to the Committee and hinder the Committee&#39;s examination.&quot; </em></p><p><em>— Chairman Chuck Grassley, Senate Judiciary Committee </em></p><p>Other claimed occurrences including Kavanaugh, said to have happened in three states, were observed not to be tenable. </p><p>Grassley likewise asked for an examination concerning Judy Munro-Leighton, who namelessly guaranteed Kavanaugh slapped her and constrained her to perform oral sex on him. </p><h4>KAVANAUGH ACCUSER REFERRED TO DOJ FOR FALSE STATEMENTS, GRASSLEY&#39;S OFFICE ANNOUNCES </h4><p>Munro-Leighton reached the panel in October asserting she composed an unknown letter blaming the judge for sexual unfortunate behavior. Grassley said she later abjured creation and admitted to not knowing Kavanaugh under addressing from the board of trustees. </p><p>&quot;She later conceded that she was not its creator and only utilized it as a &quot;ploy&quot; to &quot;get consideration&quot; and had never met Justice Kavanaugh,&quot; as per the letter. </p><p>In September, President Trump requested a constrained FBI test into claims by Ford and informer Deborah Ramirez. </p><p>The examination found no proof of bad behavior on Kavanaugh&#39;s part.</p>"}}}}]}},"pageContext":{"productId":10}}