{"data":{"allPrismicNewspost":{"edges":[{"node":{"id":"Prismic__Newspost__W98jshEAACQALFhS","data":{"id":0,"title":{"text":"Synagogue vandalism suspect in NYC worked for Obama campaign in 2008, reports say","html":"<h1>Synagogue vandalism suspect in NYC worked for Obama campaign in 2008, reports say</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/7b0115aebfbba9e2e81db9dd66a37feff748aed3_pol99.jpg"},"description":{"text":"A 26-year-elderly person accused of vandalizing a noteworthy New York City synagogue on Friday, only days after the Pittsburgh slaughter, has been distinguished as a previous battle specialist for Barack Obama who was profiled by the New York Times in 2017.  The Times described James Polite as a young fellow who \"spent quite a bit of his youth in child care,\" and performed peddling work for Obama's 2008 presidential crusade. After a shot gathering, he landed a position that year as an understudy for Christine Quinn, a previous speaker of New York's city board who was likewise a previous mayoral hopeful.  On Friday, Polite was arrested and accused of criminal devilishness as a despise crime in association with vandalism Thursday at the Union Temple in Brooklyn that constrained the cancelation of a political occasion.  New York Mayor Bill de Blasio visited the sanctuary Friday night and called the episode \"massively upsetting,\" according to the New York Daily News.  VANDALISM AT NEW YORK CITY SYNAGOGUE LEADS TO ARREST  On Saturday, Quinn affirmed that the vandalism suspect was a similar person who had worked for her.  \"I know this young fellow,\" Quinn expressed, \"and alongside numerous others in the New York City Council and social administrations organizations all through the City, have done all that I could throughout the years to help him as he experienced childhood all through the encourage framework, all through the emotional well-being framework, and all through vagrancy. The activities he is blamed for make me extremely upset and obliterate every one of us who attempted to enable him to get on strong balance throughout the years.\"  Police said that spray painting seen at the Brooklyn synagogue included articulations, for example, \"Jews should be prepared\" and \"Kick the bucket Jew rodents, we are here!\"  After Polite was captured, he was sent to a mental ward at Woodhull Hospital in Brooklyn, as per reports. A New York Police Department spokeswoman told Heavy.com that Polite was likely taken there as a result of conduct amid the capture.  As per Heavy.com, the NYPD says that generally 50% of the about 300 detest wrongdoings submitted in the city this year have included enemy of Semitism.  In the interim, experts over the U.S. have revealed various demonstrations of vandalism at synagogues since the Pittsburgh slaughter.","html":"<p>A 26-year-elderly person accused of vandalizing a noteworthy New York City synagogue on Friday, only days after the Pittsburgh slaughter, has been distinguished as a previous battle specialist for Barack Obama who was profiled by the New York Times in 2017. </p><p>The Times described James Polite as a young fellow who &quot;spent quite a bit of his youth in child care,&quot; and performed peddling work for Obama&#39;s 2008 presidential crusade. After a shot gathering, he landed a position that year as an understudy for Christine Quinn, a previous speaker of New York&#39;s city board who was likewise a previous mayoral hopeful. </p><p>On Friday, Polite was arrested and accused of criminal devilishness as a despise crime in association with vandalism Thursday at the Union Temple in Brooklyn that constrained the cancelation of a political occasion. </p><p>New York Mayor Bill de Blasio visited the sanctuary Friday night and called the episode &quot;massively upsetting,&quot; according to the New York Daily News. </p><h4><strong>VANDALISM AT NEW YORK CITY SYNAGOGUE LEADS TO ARREST</strong></h4><p></p><p>On Saturday, Quinn affirmed that the vandalism suspect was a similar person who had worked for her. </p><p>&quot;I know this young fellow,&quot; Quinn expressed, &quot;and alongside numerous others in the New York City Council and social administrations organizations all through the City, have done all that I could throughout the years to help him as he experienced childhood all through the encourage framework, all through the emotional well-being framework, and all through vagrancy. The activities he is blamed for make me extremely upset and obliterate every one of us who attempted to enable him to get on strong balance throughout the years.&quot; </p><p>Police said that spray painting seen at the Brooklyn synagogue included articulations, for example, &quot;Jews should be prepared&quot; and &quot;Kick the bucket Jew rodents, we are here!&quot; </p><p>After Polite was captured, he was sent to a mental ward at Woodhull Hospital in Brooklyn, as per reports. A New York Police Department spokeswoman told Heavy.com that Polite was likely taken there as a result of conduct amid the capture. </p><p>As per Heavy.com, the NYPD says that generally 50% of the about 300 detest wrongdoings submitted in the city this year have included enemy of Semitism. </p><p>In the interim, experts over the U.S. have revealed various demonstrations of vandalism at synagogues since the Pittsburgh slaughter.</p>"}}}}]}},"pageContext":{"productId":0}}