{"data":{"allPrismicNewspost":{"edges":[{"node":{"id":"Prismic__Newspost__W98myhEAACMALGXr","data":{"id":4,"title":{"text":"These are the victims of the Florida yoga studio shooting","html":"<h1>These are the victims of the Florida yoga studio shooting</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/fd0e7a690fd2bea9eb02fe7b1916c44f4ed3ff5f_181103134804-tallahassee-yoga-victims-split-exlarge-169.jpg"},"description":{"text":"(CNN)Police have recognized the ladies who were killed Friday when a shooter raged a yoga studio in Tallahassee, Florida, and opened fire.  Nancy Van Vessem was a specialist. Maura Binkley was an undergrad. Both were a piece of the Florida State University people group.  This is what we think about them:  Maura Binkley  Florida State University understudy Maura Binkley was a \"dearest sister,\" her sorority said.  Binkley was a 21-year-old understudy at Florida State, as indicated by school President John Thrasher.  In an announcement presented on its Facebook page, the Delta sorority considered Binkley an \"adored sister.\"  She experienced childhood in the Atlanta metro zone and was known to loved ones for her empathy.  Her dad, Jeff Binkley, revealed to CNN his little girl \"just emanated love for everyone.\"  \"You could see her life radiates through pretty much everyone she met,\" he said. \"That is encouragement to us.\"  After the Parkland school shooting in February, Binkley went to the state Capitol with the Parkland understudies and their families to campaign for change.  She later asked her dad, \"Father, what would i be able to do? What would i be able to do about this?\" he said.  \"We discussed it never imagining that it would have been us,\" Jeff Binkley said.  The yoga studio where she was executed had been there for a considerable length of time, he stated, and was appropriate over one of his most loved eateries to eat with Maura when he was around the local area.  \"As a pioneer in the (Alpha Eta) part, Maura epitomized the Tri Delta lady - valiant, strong and kind,\" the announcement from President Kimberlee Sullivan said. \"Our hearts are with her family, our sisters and the FSU people group amid this troublesome time.\"  As indicated by FSU's site, Binkley was contemplating for a twofold major in English and German.  Binkley spent this past summer learning at the University of Wuppertal in Germany, the site stated, and she found the experience \"so fulfilling.\"  \"Maura genuinely carried on with a real existence extremely dedicated to peace, love and thinking about others,\" Jeff Binkley disclosed to CNN subsidiary WSB.  Her dad said Binkley intended to graduate school in May and had been chipping away at her Teach for America application.  Nancy Van Vessem  Dr. Nancy Van Vessem was boss restorative executive for Florida's Capital Health Plan.  Van Vessem, 61, was a specialist who was boss restorative executive for Capital Health Plan, as indicated by the Tallahassee Democrat. She was likewise an employee at Florida State, Thrasher said.  As per the Florida State College of Medicine's site, Van Vessem was accountable for planning third and fourth year clerkship revolutions in interior drug on the school's Tallahassee grounds. She had gotten her therapeutic degree from St. Louis University, the site stated, and her examination center was \"rebuilding social insurance for individuals with numerous perpetual illnesses.\"  Huge Bend Hospice in Tallahassee shared a tribute to Van Vessem on its Facebook page, calling the specialist \"a doctor and pioneer who contacted endless lives as Chief Medical Officer at Capital Health Plan.\"  \"Dr. Van Vessem was a piece of the Big Bend Hospice people group,\" the announcement said. \"She was our companion and a hero for end-of-life care.\"","html":"<p>(CNN)Police have recognized the ladies who were killed Friday when a shooter raged a yoga studio in Tallahassee, Florida, and opened fire. </p><p>Nancy Van Vessem was a specialist. Maura Binkley was an undergrad. Both were a piece of the Florida State University people group. </p><p>This is what we think about them: </p><h4>Maura Binkley </h4><p>Florida State University understudy Maura Binkley was a &quot;dearest sister,&quot; her sorority said. </p><p>Binkley was a 21-year-old understudy at Florida State, as indicated by school President John Thrasher. </p><p>In an announcement presented on its Facebook page, the Delta sorority considered Binkley an &quot;adored sister.&quot; </p><p>She experienced childhood in the Atlanta metro zone and was known to loved ones for her empathy. </p><p>Her dad, Jeff Binkley, revealed to CNN his little girl &quot;just emanated love for everyone.&quot; </p><p>&quot;You could see her life radiates through pretty much everyone she met,&quot; he said. &quot;That is encouragement to us.&quot; </p><p>After the Parkland school shooting in February, Binkley went to the state Capitol with the Parkland understudies and their families to campaign for change. </p><p>She later asked her dad, &quot;Father, what would i be able to do? What would i be able to do about this?&quot; he said. </p><p>&quot;We discussed it never imagining that it would have been us,&quot; Jeff Binkley said. </p><p>The yoga studio where she was executed had been there for a considerable length of time, he stated, and was appropriate over one of his most loved eateries to eat with Maura when he was around the local area. </p><p>&quot;As a pioneer in the (Alpha Eta) part, Maura epitomized the Tri Delta lady - valiant, strong and kind,&quot; the announcement from President Kimberlee Sullivan said. &quot;Our hearts are with her family, our sisters and the FSU people group amid this troublesome time.&quot; </p><p>As indicated by FSU&#39;s site, Binkley was contemplating for a twofold major in English and German. </p><p>Binkley spent this past summer learning at the University of Wuppertal in Germany, the site stated, and she found the experience &quot;so fulfilling.&quot; </p><p>&quot;Maura genuinely carried on with a real existence extremely dedicated to peace, love and thinking about others,&quot; Jeff Binkley disclosed to CNN subsidiary WSB. </p><p>Her dad said Binkley intended to graduate school in May and had been chipping away at her Teach for America application. </p><h4>Nancy Van Vessem </h4><p>Dr. Nancy Van Vessem was boss restorative executive for Florida&#39;s Capital Health Plan. </p><p>Van Vessem, 61, was a specialist who was boss restorative executive for Capital Health Plan, as indicated by the Tallahassee Democrat. She was likewise an employee at Florida State, Thrasher said. </p><p>As per the Florida State College of Medicine&#39;s site, Van Vessem was accountable for planning third and fourth year clerkship revolutions in interior drug on the school&#39;s Tallahassee grounds. She had gotten her therapeutic degree from St. Louis University, the site stated, and her examination center was &quot;rebuilding social insurance for individuals with numerous perpetual illnesses.&quot; </p><p>Huge Bend Hospice in Tallahassee shared a tribute to Van Vessem on its Facebook page, calling the specialist &quot;a doctor and pioneer who contacted endless lives as Chief Medical Officer at Capital Health Plan.&quot; </p><p>&quot;Dr. Van Vessem was a piece of the Big Bend Hospice people group,&quot; the announcement said. &quot;She was our companion and a hero for end-of-life care.&quot;</p>"}}}}]}},"pageContext":{"productId":4}}