{"data":{"allPrismicNewspost":{"edges":[{"node":{"id":"Prismic__Newspost__W98pyhEAACQALHMv","data":{"id":8,"title":{"text":"Utah mayor, a father of 7, ID’d as US service member killed in ‘insider attack’ in Afghanistan","html":"<h1>Utah mayor, a father of 7, ID’d as US service member killed in ‘insider attack’ in Afghanistan</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/62842d302349e5e8ef58512969ba01b2b919715c_utah88.jpeg"},"description":{"text":"A previous leader from Utah who has served in the state's National Guard since 2013 was distinguished Saturday as the U.S. benefit part who was killed in an \"insider assault\" in Afghanistan prior in the day, as indicated by reports.  Brent Taylor, a wedded dad of seven youngsters who was sent to Afghanistan in January, was a previous chairman of North Ogden, a city of around 17,000 individuals situated around 46 miles north of Salt Lake City. Taylor surrendered from the chairman's office before he went overseas, the Standard-Examiner of Ogden detailed.  Taylor's demise was affirmed by North Ogden City Councilman Phil Swanson, who spoke with FOX 13 Salt Lake City. Swanson depicted Taylor as a \"unique\" individual.  U.S. Sen. Orrin Hatch, R-Utah, in a Twitter message, portrayed Taylor's passing as \"crushing\" news.  \"Brent was a saint, a loyalist, a magnificent dad, and a dear companion,\" Sen. Bring forth composed. \"News of his passing in Afghanistan is annihilating. My supplications and love are with Jennie and his 7 youthful youngsters. His administration will dependably be recalled.\"  Incubate on the demise of North Ogden Mayor Brent Taylor: \"Brent was a legend, a nationalist, a superb dad, and a dear companion. News of his passing in Afghanistan is annihilating. My supplications and love are with Jennie and his 7 youthful youngsters. His administration will dependably be recollected.\"  U.S. Sen. Mike Lee, R-Utah, wrote on Facebook that Taylor was \"the meaning of the term 'community worker.'\"  \"In the coming days,\" Sen. Lee stated, \"Utahns who never had the benefit of meeting Brent will realize what sort of man North Ogden and the Taylor family have lost, and will go along with them in lamenting his sad misfortune.\"  Utah Gov. Gary Herbert and Maj. Gen. Jefferson S. Burton of the Utah National Guard intend to talk with correspondents at twelve Sunday neighborhood time at the express Guard's central station, FOX 13 revealed.  In an announcement Saturday, Herbert considered Taylor a \"bold and sacrificial soldier,\" the Salt Lake Tribune detailed.  \"The whole Herbert family grieves with this present officer's family and we supplicate that their weights might be lifted, and that the hearts of all Utahns will connect with solace them in their anguish,\" the representative included.  \"My heart breaks for the misfortune and forfeit of our warrior, especially for the family,\" Burton said in an announcement, as indicated by the Tribune. \"I wish them all the solace and strength to confront the troublesome days ahead.\"  In a Facebook post in January, not long after his sending, Taylor portrayed what filling in as a leader and as a Guardsmen intended to him.  \"Filling in as the chairman of North Ogden city has been one of the best respects of my life and the feature of my non military personnel proficient vocation,\" Taylor composed. \"Administration is truly what authority is about.\"  \"Filling in as the chairman of North Ogden city has been one of the best respects of my life and the feature of my regular citizen proficient vocation. Administration is truly what initiative is about.\"  — Brent Taylor, in Facebook post  The assault in which Taylor was murdered occurred in Kabul, the capital of Afghanistan. Taylor was the eighth American murdered in real life in the nation this year.  Saturday's assault was the fifth \"insider assault\" in the previous four months against U.S. powers.  Beginning reports demonstrate the assailant was an individual from the Afghan National Defense and Security Forces and he was instantly slaughtered by other Afghan powers.  Another U.S. benefit part was harmed in the assault. The injured administration part was experiencing medicinal treatment and was in stable condition. The episode is under scrutiny.  Taylor is made due by his better half, Jennie, and seven kids, as per the Tribune.  A GoFundMe page has been set up for Taylor's family. Late Saturday it had achieved more than $19,000 toward a $250,000 objective.","html":"<p>A previous leader from Utah who has served in the state&#39;s National Guard since 2013 was distinguished Saturday as the U.S. benefit part who was killed in an &quot;insider assault&quot; in Afghanistan prior in the day, as indicated by reports. </p><p>Brent Taylor, a wedded dad of seven youngsters who was sent to Afghanistan in January, was a previous chairman of North Ogden, a city of around 17,000 individuals situated around 46 miles north of Salt Lake City. Taylor surrendered from the chairman&#39;s office before he went overseas, the Standard-Examiner of Ogden detailed. </p><p>Taylor&#39;s demise was affirmed by North Ogden City Councilman Phil Swanson, who spoke with FOX 13 Salt Lake City. Swanson depicted Taylor as a &quot;unique&quot; individual. </p><p>U.S. Sen. Orrin Hatch, R-Utah, in a Twitter message, portrayed Taylor&#39;s passing as &quot;crushing&quot; news. </p><p>&quot;Brent was a saint, a loyalist, a magnificent dad, and a dear companion,&quot; Sen. Bring forth composed. &quot;News of his passing in Afghanistan is annihilating. My supplications and love are with Jennie and his 7 youthful youngsters. His administration will dependably be recalled.&quot; </p><p>Incubate on the demise of North Ogden Mayor Brent Taylor: &quot;Brent was a legend, a nationalist, a superb dad, and a dear companion. News of his passing in Afghanistan is annihilating. My supplications and love are with Jennie and his 7 youthful youngsters. His administration will dependably be recollected.&quot; </p><p>U.S. Sen. Mike Lee, R-Utah, wrote on Facebook that Taylor was &quot;the meaning of the term &#39;community worker.&#39;&quot; </p><p>&quot;In the coming days,&quot; Sen. Lee stated, &quot;Utahns who never had the benefit of meeting Brent will realize what sort of man North Ogden and the Taylor family have lost, and will go along with them in lamenting his sad misfortune.&quot; </p><p>Utah Gov. Gary Herbert and Maj. Gen. Jefferson S. Burton of the Utah National Guard intend to talk with correspondents at twelve Sunday neighborhood time at the express Guard&#39;s central station, FOX 13 revealed. </p><p>In an announcement Saturday, Herbert considered Taylor a &quot;bold and sacrificial soldier,&quot; the Salt Lake Tribune detailed. </p><p>&quot;The whole Herbert family grieves with this present officer&#39;s family and we supplicate that their weights might be lifted, and that the hearts of all Utahns will connect with solace them in their anguish,&quot; the representative included. </p><p>&quot;My heart breaks for the misfortune and forfeit of our warrior, especially for the family,&quot; Burton said in an announcement, as indicated by the Tribune. &quot;I wish them all the solace and strength to confront the troublesome days ahead.&quot; </p><p>In a Facebook post in January, not long after his sending, Taylor portrayed what filling in as a leader and as a Guardsmen intended to him. </p><p>&quot;Filling in as the chairman of North Ogden city has been one of the best respects of my life and the feature of my non military personnel proficient vocation,&quot; Taylor composed. &quot;Administration is truly what authority is about.&quot; </p><p>&quot;Filling in as the chairman of North Ogden city has been one of the best respects of my life and the feature of my regular citizen proficient vocation. Administration is truly what initiative is about.&quot; </p><p>— Brent Taylor, in Facebook post </p><p>The assault in which Taylor was murdered occurred in Kabul, the capital of Afghanistan. Taylor was the eighth American murdered in real life in the nation this year. </p><p>Saturday&#39;s assault was the fifth &quot;insider assault&quot; in the previous four months against U.S. powers. </p><p>Beginning reports demonstrate the assailant was an individual from the Afghan National Defense and Security Forces and he was instantly slaughtered by other Afghan powers. </p><p>Another U.S. benefit part was harmed in the assault. The injured administration part was experiencing medicinal treatment and was in stable condition. The episode is under scrutiny. </p><p>Taylor is made due by his better half, Jennie, and seven kids, as per the Tribune. </p><p>A GoFundMe page has been set up for Taylor&#39;s family. Late Saturday it had achieved more than $19,000 toward a $250,000 objective.</p>"}}}}]}},"pageContext":{"productId":8}}